In [1]:
import pandas as pd
import numpy as np
import json 
import ast

In [ ]:
pd

In [5]:
credits_data = pd.read_csv("credits.csv")

In [6]:
credits_data

,cast,crew,id
0,"[{'cast_id': 14, 'character': 'Woody (voice)',...","[{'credit_id': '52fe4284c3a36847f8024f49', 'de...",862
1,"[{'cast_id': 1, 'character': 'Alan Parrish', '...","[{'credit_id': '52fe44bfc3a36847f80a7cd1', 'de...",8844
2,"[{'cast_id': 2, 'character': 'Max Goldman', 'c...","[{'credit_id': '52fe466a9251416c75077a89', 'de...",15602
3,"[{'cast_id': 1, 'character': ""Savannah 'Vannah...","[{'credit_id': '52fe44779251416c91011acb', 'de...",31357
4,"[{'cast_id': 1, 'character': 'George Banks', '...","[{'credit_id': '52fe44959251416c75039ed7', 'de...",11862
...,...,...,...
45471,"[{'cast_id': 0, 'character': '', 'credit_id': ...","[{'credit_id': '5894a97d925141426c00818c', 'de...",439050
45472,"[{'cast_id': 1002, 'character': 'Sister Angela...","[{'credit_id': '52fe4af1c3a36847f81e9b15', 'de...",111109
45473,"[{'cast_id': 6, 'character': 'Emily Shaw', 'cr...","[{'credit_id': '52fe4776c3a368484e0c8387', 'de...",67758
45474,"[{'cast_id': 2, 'character': '', 'credit_id': ...","[{'credit_id': '533bccebc3a36844cf0011a7', 'de...",227506
45475,[],"[{'credit_id': '593e676c92514105b702e68e', 'de...",461257

In [7]:
credits_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45476 entries, 0 to 45475
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   cast    45476 non-null  object
 1   crew    45476 non-null  object
 2   id      45476 non-null  int64
dtypes: int64(1), object(2)
memory usage: 1.0+ MB

Visulaizar duplicados

In [8]:
print(credits_data.id.duplicated().sum())

44

Eliminar duplicados

In [9]:
credits_data.drop_duplicates(subset='id',keep="first" ,inplace=True)

Funcion para desanidar culumna para saccar dirtectores

In [10]:
def convertir(obj):
    C = []
    for i in ast.literal_eval(obj):
        if i["job"] == "Director":
            C.append (i["name"])
            break
    return C

In [11]:
credits_data["crew"]=credits_data["crew"].apply(convertir)

In [12]:
credits_data.head()

                                                cast               crew     id
0  [{'cast_id': 14, 'character': 'Woody (voice)',...    [John Lasseter]    862
1  [{'cast_id': 1, 'character': 'Alan Parrish', '...     [Joe Johnston]   8844
2  [{'cast_id': 2, 'character': 'Max Goldman', 'c...    [Howard Deutch]  15602
3  [{'cast_id': 1, 'character': "Savannah 'Vannah...  [Forest Whitaker]  31357
4  [{'cast_id': 1, 'character': 'George Banks', '...    [Charles Shyer]  11862

Eliminar columna cast, no es necesaria para el proyecto

In [13]:
credits_data.drop(["cast"], axis = 1, inplace = True)

In [14]:
credits_data.reset_index(drop=True,inplace=True)

In [15]:
credits_data.head()

                crew     id
0    [John Lasseter]    862
1     [Joe Johnston]   8844
2    [Howard Deutch]  15602
3  [Forest Whitaker]  31357
4    [Charles Shyer]  11862

Exportart dataset

In [16]:
credits_data.to_csv("CREDITS_ETL.csv")

Prueba: importar y visualizar

In [20]:
Prueba = pd.read_csv("CREDITS_ETL.csv", dtype=str, low_memory=False)
Prueba

      Unnamed: 0                  crew      id
0              0     ['John Lasseter']     862
1              1      ['Joe Johnston']    8844
2              2     ['Howard Deutch']   15602
3              3   ['Forest Whitaker']   31357
4              4     ['Charles Shyer']   11862
...          ...                   ...     ...
45427      45427  ['Hamid Nematollah']  439050
45428      45428          ['Lav Diaz']  111109
45429      45429    ['Mark L. Lester']   67758
45430      45430  ['Yakov Protazanov']  227506
45431      45431     ['Daisy Asquith']  461257

[45432 rows x 3 columns]

In [22]:
Prueba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45432 entries, 0 to 45431
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  45432 non-null  object
 1   crew        45432 non-null  object
 2   id          45432 non-null  object
dtypes: object(3)
memory usage: 1.0+ MB